Chapter 3. Data Wrangling
Data wrangling in data science is the process of transforming raw data to a clean and organized format ready for use. It is the preprocessing of data.

In [3]:
import numpy as np


import pandas as pd
from sklearn import datasets
import matplotlib.pyplot as plt

In [10]:
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [101]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

3.1 Creating a dataframe

In [50]:
dataframe = pd.DataFrame()
dataframe['Name'] = ['Jacky Johnson','Steven Stevenson','John Malcolm']
dataframe['Age'] = ['21.','43.','36.']
dataframe['Driver'] = [True,False,True]
dataframe

               Name  Age  Driver
0     Jacky Johnson  21.    True
1  Steven Stevenson  43.   False
2      John Malcolm  36.    True

In [51]:
new_person = pd.Series(['Molly Hatchet',35.,True],index = ['Name','Age','Driver'])

In [52]:
dataframe.append(new_person,ignore_index = True)
dataframe

               Name  Age  Driver
0     Jacky Johnson  21.    True
1  Steven Stevenson  43.   False
2      John Malcolm  36.    True

In [53]:
dataframe = dataframe.append(new_person,ignore_index = True)

In [54]:
dataframe

               Name  Age  Driver
0     Jacky Johnson  21.    True
1  Steven Stevenson  43.   False
2      John Malcolm  36.    True
3     Molly Hatchet   35    True

3.2 Describing the Data

In [11]:
file = 'content_linksA.csv'
dataframe = pd.read_csv(url)

In [12]:
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [13]:
dataframe.shape

(1313, 6)

In [14]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

3.3 Navigating DataFrames

iloc is used when index is numeric

In [78]:
#Select 1st row
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [79]:
#Select 3 rows
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [106]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [107]:
dataframe.loc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [83]:
dataframe = dataframe.set_index(dataframe['Name'])

loc is used when index is non-numeric

In [84]:
dataframe.loc['Allison, Miss Helen Loraine']

Name        Allison, Miss Helen Loraine
PClass                              1st
Age                                   2
Sex                              female
Survived                              0
SexCode                               1
Name: Allison, Miss Helen Loraine, dtype: object

In [85]:
dataframe.loc['Allison, Miss Helen Loraine':'Allison, Mr Hudson Joshua Creighton']

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0

3.4 Selecting rows based on condition

In [87]:
dataframe[dataframe['Sex'] ==  'female'].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
"Appleton, Mrs Edward Dale (Charlotte Lamson)","Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [90]:
dataframe[(dataframe['Sex'] ==  'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [92]:
dataframe[(dataframe['Sex'] ==  'female') & (dataframe['Age'] >= 43)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
"Appleton, Mrs Edward Dale (Charlotte Lamson)","Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
"Baxter, Mrs James (Helene DeLaudeniere Chaput)","Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.0,female,1,1
"Beckwith, Mrs Richard Leonard (Sallie Monypeny)","Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.0,female,1,1
"Bonnell, Miss Elizabeth","Bonnell, Miss Elizabeth",1st,58.0,female,1,1
...,...,...,...,...,...,...
"Goodwin, Mrs Frederick (Augusta)","Goodwin, Mrs Frederick (Augusta)",3rd,43.0,female,0,1
"Hansen, Mrs Claus Peter","Hansen, Mrs Claus Peter",3rd,45.0,female,1,1
"Lindblom, Miss Augusta Charlotta","Lindblom, Miss Augusta Charlotta",3rd,45.0,female,0,1
"Turkula, Mrs Hedvig","Turkula, Mrs Hedvig",3rd,63.0,female,1,1
"Wilkes, Mrs Ellen","Wilkes, Mrs Ellen",3rd,45.0,female,1,1

3.5 Replacing Values

In [93]:
dataframe['Sex'].replace('female','Woman').head()

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton               male
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                     male
Name: Sex, dtype: object

In [96]:
dataframe['Sex'].replace(['female','male'],['Woman','Dogs']).head()

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton               Dogs
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                     Dogs
Name: Sex, dtype: object

In [97]:
dataframe.replace(1,'One').head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,One,One
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,One
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25,female,0,One
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,One,0

In [98]:
dataframe.replace('1st','first',regex=True).head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",first,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",first,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",first,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",first,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",first,0.92,male,1,0

In [ ]:
3.6 Renaming columns

In [15]:
dataframe = pd.read_csv(url)

In [111]:
dataframe.rename(columns={'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [113]:
dataframe.rename(columns={'PClass':'Passenger Class','Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [115]:
# To rename all columns at once
import collections
column_names = collections.defaultdict(str)

In [117]:
for name in dataframe.columns:
    column_names[name]

In [120]:
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

3.7 Finding the Minimum, Maximum, Sum. Average, and Count

In [121]:
dataframe = pd.read_csv(url)

In [124]:
print('Maximum Age:',dataframe['Age'].max())
print('Minimum Age:',dataframe['Age'].min())
print('Sum Age :',dataframe['Age'].sum())
print('Count Age:',dataframe['Age'].count())

Maximum: 71.0
Maximum: 0.17
Maximum: 22980.88
Maximum: 756

In [125]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [126]:
dataframe.sum()

Name        Allen, Miss Elisabeth WaltonAllison, Miss Hele...
PClass      1st1st1st1st1st1st1st1st1st1st1st1st1st1st1st1...
Age                                                   22980.9
Sex         femalefemalemalefemalemalemalefemalemalefemale...
Survived                                                  450
SexCode                                                   462
dtype: object

3.8 Finding unique values

In [128]:
dataframe=pd.read_csv(url)

In [129]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [130]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [131]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [132]:
dataframe['PClass'].nunique()

4

3.9 Handling Missing Values

In [133]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [134]:
dataframe['Sex'] = dataframe['Sex'].replace('male',np.nan)

In [135]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,NaN,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,NaN,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,NaN,0,0
1310,"Zenni, Mr Philip",3rd,22.00,NaN,0,0
1311,"Lievens, Mr Rene",3rd,24.00,NaN,0,0
1312,"Zimmerman, Leo",3rd,29.00,NaN,0,0

In [16]:
dataframe = pd.read_csv(url,na_values =[np.nan,'NONE',-999])

In [17]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

3.10 Deleting a column

In [139]:
dataframe.drop('Age',axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [140]:
dataframe.drop(['Age','Sex'],axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [142]:
dataframe.drop(dataframe.columns[1],axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [144]:
dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)
dataframe_name_dropped

     PClass    Age     Sex  Survived  SexCode
0       1st  29.00  female         1        1
1       1st   2.00  female         0        1
2       1st  30.00    male         0        0
3       1st  25.00  female         0        1
4       1st   0.92    male         1        0
...     ...    ...     ...       ...      ...
1308    3rd  27.00    male         0        0
1309    3rd  26.00    male         0        0
1310    3rd  22.00    male         0        0
1311    3rd  24.00    male         0        0
1312    3rd  29.00    male         0        0

[1313 rows x 5 columns]

3.11 Deleting s Row

In [149]:
dataframe = pd.read_csv(url)

In [163]:
dataframe[dataframe.Sex != 'male'].head(10)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
12,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
15,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.0,female,1,1
19,"Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.0,female,1,1
23,"Bishop, Mrs Dickinson H (Helen Walton)",1st,19.0,female,1,1

3.12 Dropping duplicate rows

In [166]:
dataframe[dataframe.index != 0].head()

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

In [21]:
dataframe = pd.read_csv(url)
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [22]:
dataframe[dataframe.columns[2:4]].iloc[2:4]

    Age     Sex
2  30.0    male
3  25.0  female

In [168]:
dataframe.drop_duplicates().head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [169]:
print('Number of rows in the original dataframe:',len(dataframe))

Number of rows in the original dataframe: 1313

In [170]:
print('Number of rows after reduping:',len(dataframe.drop_duplicates()))

Number of rows after reduping: 1313

In [171]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [172]:
dataframe.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [173]:
dataframe.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

3.13 Grouping Rows by values

In [174]:
dataframe = pd.read_csv(url)

In [175]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [176]:
dataframe.groupby('Sex')

In [177]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [179]:
dataframe.groupby(['Sex','Survived']).mean()

                       Age  SexCode
Sex    Survived
female 0         24.901408        1
       1         30.867143        1
male   0         32.320780        0
       1         25.951875        0

In [180]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

3.14 Grouping Rows by time

In [182]:
# This will create 100000 values starting from 06/06/2017 incremented by 30 seconds.
time_index = pd.date_range('06/06/2017',periods=100000,freq='30S')

In [183]:
dataframe = pd.DataFrame(index=time_index)

In [207]:
import random
random.seed(1)

In [243]:
dataframe['Sale_Amount'] = np.random.randint(1,10,100000)
dataframe.head()

                     Sale_Amount
2017-06-06 00:00:00            3
2017-06-06 00:00:30            7
2017-06-06 00:01:00            6
2017-06-06 00:01:30            9
2017-06-06 00:02:00            7

In [242]:
# Resample requires the index of the dataframe to be datetime.
# Resample groups the rows by a wide range of time periods(offsets) allowing us to calculate statistics on each time group such as 
# This resamples by one week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        85828
2017-06-18       100346
2017-06-25       101210
2017-07-02       101311
2017-07-09       101616
2017-07-16        10381

In [244]:
# This resamples by two weeks
dataframe.resample('2W').sum()

            Sale_Amount
2017-06-11        86136
2017-06-25       202522
2017-07-09       200948
2017-07-23        10375

In [245]:
# This resamples by one month
dataframe.resample('M').sum()

            Sale_Amount
2017-06-30       360602
2017-07-31       139379

3.15 Looping over a column

In [247]:
dataframe = pd.read_csv(url)

In [248]:
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [251]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

3.16 Applying a function over all elements in a column

In [ ]:
dataframe = pd.read_csv(url)

In [252]:
def uppercase(x):
    return x.upper()

In [253]:
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

3.17 Applying a function to groups

In [254]:
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

3.18 Concatenating dataframes

In [256]:
data_a = {'id' : ['1','2','3'],
           'first' :['Alex','Amy','Allen'],
           'last':['Anderson','Ackerman','Ali'] }
dataframe_a = pd.DataFrame(data_a,columns=['id','first','last'])
dataframe_a

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali

In [257]:
data_b = {'id' : ['4','5','6'],
           'first' :['Billy','Brian','Bran'],
           'last':['Bonder','Black','Balwer'] }
dataframe_b = pd.DataFrame(data_b,columns=['id','first','last'])
dataframe_b

  id  first    last
0  4  Billy  Bonder
1  5  Brian   Black
2  6   Bran  Balwer

In [259]:
pd.concat([dataframe_a,dataframe_b],axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran    Balwer

In [260]:
pd.concat([dataframe_a,dataframe_b],axis=1)

  id  first      last id  first    last
0  1   Alex  Anderson  4  Billy  Bonder
1  2    Amy  Ackerman  5  Brian   Black
2  3  Allen       Ali  6   Bran  Balwer

In [263]:
row = pd.Series([10,'chris', 'chillon'],index=['id','first','last'])

In [264]:
dataframe_a.append(row,ignore_index = True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  chris   chillon

3.19 Merging dataframes

In [265]:
employee_data = {'employee_id' : ['1','2','3','4'],
           'name' :['Amy Jones','Allen Alda','Chich Moran','tomy chung']}
dataframe_employee = pd.DataFrame(employee_data,columns=['employee_id','name'])
dataframe_employee

  employee_id         name
0           1    Amy Jones
1           2   Allen Alda
2           3  Chich Moran
3           4   tomy chung

In [266]:
sales_data = {'employee_id' : ['3','4','5','6'],
           'total_sales' :[23456,3456,3423,431]}
dataframe_sales = pd.DataFrame(sales_data,columns=['employee_id','total_sales'])
dataframe_sales

  employee_id  total_sales
0           3        23456
1           4         3456
2           5         3423
3           6          431

In [267]:
# This does an inner join of the two dataframes
pd.merge(dataframe_employee,dataframe_sales,on='employee_id')

  employee_id         name  total_sales
0           3  Chich Moran        23456
1           4   tomy chung         3456

In [268]:
# This does an outer join of the two dataframes
pd.merge(dataframe_employee,dataframe_sales,on='employee_id',how='outer')

  employee_id         name  total_sales
0           1    Amy Jones          NaN
1           2   Allen Alda          NaN
2           3  Chich Moran      23456.0
3           4   tomy chung       3456.0
4           5          NaN       3423.0
5           6          NaN        431.0

In [269]:
# This does an left join of the two dataframes
pd.merge(dataframe_employee,dataframe_sales,on='employee_id',how='left')

  employee_id         name  total_sales
0           1    Amy Jones          NaN
1           2   Allen Alda          NaN
2           3  Chich Moran      23456.0
3           4   tomy chung       3456.0

In [270]:
# merge by column name
pd.merge(dataframe_employee,dataframe_sales,left_on='employee_id',right_on='employee_id')

  employee_id         name  total_sales
0           3  Chich Moran        23456
1           4   tomy chung         3456

In [272]:
# instead of column names, merge on the indices of each dataframe
pd.merge(dataframe_employee,dataframe_sales,left_index=True,right_index=True)

  employee_id_x         name employee_id_y  total_sales
0             1    Amy Jones             3        23456
1             2   Allen Alda             4         3456
2             3  Chich Moran             5         3423
3             4   tomy chung             6          431

In [273]:
Europe_sales_data = {'employee_id_EU' : ['3','4','5','6'],
           'total_sales' :[23456,3456,3423,431]}
dataframe_Europe_sales = pd.DataFrame(Europe_sales_data,columns=['employee_id','total_sales'])
dataframe_Europe_sales

  employee_id  total_sales
0         NaN        23456
1         NaN         3456
2         NaN         3423
3         NaN          431

In [275]:
pd.merge(dataframe_employee,dataframe_Europe_sales,left_on='employee_id',right_on='employee_id_EU')

KeyError: 'employee_id_EU'